#--------------------------------------------bool----------------------------------------------------------
g = str("asd")
print(bool(g))

i = str("")
print(bool(i))

f = int("1")
print(bool(f))

x = int("0")
print(bool(x))
#todo как работают преобразования с типоm bool
#-----------------------------------and------------------------or------------------------------------------
a =int(input())
b =int(input())
if a == 3 and b == 4:
#!and - обязательно чтобы ВСЕ 2 или больше операнды подоходили
#! or - обязательно что бы хотя бы 1 ИЗ операндов подходил 
    print("Yes")
else:
    print("no")
#---------------------------------------------no-----------------------------------------------------------
d = int(input("asd"))
if not d < 500:
    print("zxcccccc")
elif not d > 500:
    print("qweeeeeeeeeeeeee")
#!not - соблюдает условия на оборот
#--------------------------------------------bool----------------------------------------------------------