# --------------------------------------------------------------------------
# цикл for i in range(1, 100) выводит от 1 до 99 включительно
# выводит все значения в диапозоне который мы задём
# переберает все числа в этом цкле и совершает любые действия с ними
# в скобочках задаём количество раз выполнения команды(range)
# i - просто ставишь, потом в скобочках то, сколько раз будет это повторяться и потом в print то, что будет повторяться
# --------------------------------------------------------------------------
for i in range(4):
    print("привет мама")
