a = 3.5
#a = float(тип)
#!print("hi \nvika "+str(a))
# ?чтобы конвертировать в другой тип в принте, просто перед переменной ставишь тип переменной
# todo \n - поставить в другую строку
# ===============================
# /// name = input("What your name?")
old = input("your old?")
# ================================
#  //* input - вопрос, на который отвечает пользователь
print("how are ", int(old)+10)
# даные от пользователя которые мы получаем, компьютер принимает в типе string
# чтобы не складывать переменные тип str & int, просто поставь запятую
