
from math import *
# round округляет количество знаков после ,
# ceil округляет в пользу большего числа
# !floor округляет в пользу меньшего числа
# ?trunc округляет в пользу большего число

#----------------------------------------------------------------------------------------------------------

x =round( 3.777, 2)

print(x)

x =round( 3.777)

print(x)

#----------------------------------------------------------------------------------------------------------

'''from math import *
float = i = -3.2
print(floor(i))
print(trunc(i))'''


'''float = z = 3.1
print(ceil(z))'''


'''(a) = 12.12345678
round(a, 2)
print(trunc(a))'''
