# +++++++++++++++++++++++++++++++++Функция def++++++++++++++++++++++++++++++++
#!вспомогательное слово (def) с помощью которого мы создаём функцию
def dom():
    print("dom")


dom()
#!def название функции(аргументы):\  задали функцию
# ?(табудляция, по скольку относиться к циклу)условия
# todo только на англ яз название функции()\ конец функции и запуск(завершаем названием)
'''EXAMPLE:
a = 1
b = 2

def summ(a):
    global b
    return a

summ(a)'''
# !global - делает переменную глобальной
# ?return - принимает в функцию
# !обычные переменные заданы которые ВНЕ ФУНКЦИИ нельзя использовать в функции
# +++++++++++++++++++++++++++++++++Функция def++++++++++++++++++++++++++++++++
