#---------------------------------------------------------------index--------------------------------------------------------------------


my_str = 'Python is top'
print(my_str)
print(my_str[0])
print(my_str[1])
print(my_str[2])
print(my_str[3])
print(my_str[4])
print(my_str[5])
print(my_str[6])
print(my_str[7])
print(my_str[8])
print(my_str[9])
print(my_str[10])
print(my_str[11])
print(my_str[12])
print(f'-'*20)

#------------------------------------------------------------------len--------------------------------------------------------------------

print(len(my_str))
#?узнаём длинну строки, тепреь можем обратитсья к последнему элементу строки 
print((my_str[12]))
#todo нужно помнить что счёт индексов идёт с 0, а len считает с 1, поэтому отнимаем 1 
print(f'-'*20)
#!нумерация отричательных индексов начинается с правого края (-1 )
print(my_str[-1])
