# ====================================Цикл FOR=================================
'''for i in range(1, 101):
    print(i)'''


'''for num in range(1, 20):
    if num == 10:
        continue
    print(num)'''

# !continue - пропустить\скипнуть

'''for num1 in range(1, 15):
    if num1 == 11:
        break
    print(num1)'''

# !не включая 11 или же само значение
# ================================================================================

'''# todo цикл for i in range(1, 100) выводит от 1 до 99 включительно или же выводит все значения в диапозоне который мы задём

# ?То-есть i - число, находящееся в диапазоне (100)

# !переберает все числа в этом цкле и совершает любые действия с ними

# todo в скобочках задаём количество раз выполнения команды(range)

# !i - просто ставишь, потом в скобочках то, сколько раз будет это повторяться и потом в print то, что будет повторяться'''

'''for i in range(4):
    print("привет мама")'''
# =====================================Цикл FOR===================================
