#-------------------------------------------------------------split-----------------------------------------------------------------------

my_str = 'I like python'
my_str = my_str.split(' ')
#? склеив строку пробелами, мы получим список из обьектов == количеству солов
print(my_str)

#-------------------------------------------------------------join-----------------------------------------------------------------------

my_str =' '.join(my_str)
#? соеденяет разделённую строку, перед методом, мы указываем метод разделения, таким способом...
print(my_str)

#-------------------------------------------------------------join-----------------------------------------------------------------------


my_str ='-'.join(my_str)
#? если мы напишем разделитель допустим '-', то мы получим строку, со словами разделёнными дефизом 
print(my_str)

#-------------------------------------------------------------join-----------------------------------------------------------------------
