#===============================================================срез======================================================================
my_str = 'Python is awesome'
print(my_str)
my_str = my_str[0:6]
print(my_str)
#? в срез попадает всё кроме последнего иднекса СПРАВА
#! my_str = my_str[0:6]
#todo поэтому мы берём индекс того что нам нужно +1
print(f"-"*20)

#===============================================================срез======================================================================

my_str1 = 'Python is awesome'
my_str1 = my_str1[7:9]
print(my_str1)

#===============================================================срез======================================================================

my_string = "123456789"
print(my_string)
my_string = my_string[::2]
#? это шаг - то есть к 1-ому числу мы прибавляем шаг, потом к тому что вышло и так далее...
#todo а если мы поставим -1, то получим перевёрнутую строку 
print(my_string)




