#-----------------------------------------------------------------strip------------------------------------------------------------------
my_str = ' I like python!              '
my_str = my_str.strip()
#? убирает пробелы в начале or в конце строки 
print(my_str)

#! можно так же использовать для обрезки не нужных нам символов передав их в качестве аргумента(" ")

my_str = my_str.strip('!')
print(my_str)

#-------------------------------------------------------------l/r strip-------------------------------------------------------------------

my_str1 = ' @I like python!'
my_str1 = my_str1.lstrip('@')
#? обрезать слево
my_str1 = my_str1.rsplit()
#? ну и обрезат справа соответственно 
print(my_str1)
