#===============================================================срез======================================================================
my_str = 'Python is awesome'
print(my_str)
my_str = my_str[0:6]
print(my_str)
#? в срез попадает всё кроме последнего иднекса СПРАВА
#! my_str = my_str[0:6]
#todo поэтому мы берём индекс того что нам нужно +1


#===============================================================срез======================================================================

my_str1 = 'Python is awesome'
my_str1 = my_str1[7:9]
print(my_str1)